#include <stdio.h>
#include "xnet_tiny.h"

//+---------------------------+
//|    应用层 (HTTP, DNS...)  |
//+---------------------------+
//|    传输层 (TCP / UDP)     |
//+---------------------------+
//|         IP 层             |
//+---------------------------+
//|         ARP 层            |
//+---------------------------+
//|     以太网层 (Ethernet)   |
//+---------------------------+
//|   驱动层 (NIC Driver)     |
//+---------------------------+

int main (void) {
    //初始化以太网包结构
    xnet_init();
    printf("xnet running\n");

    while (1) {
        xnet_poll();  //轮询网卡数据
    }

    return 0;
}
